[
  {
    "title": "Israel intensifies attacks on Lebanon, Gaza, occupied West Bank",
    "content": "An Israeli attack kills four paramedics near a government hospital in Marjayoun...",
    "fullContent": "An Israeli attack kills four paramedics near a government hospital in Marjayoun, a majority Christian town in southern Lebanon that had been spared in previous conflicts. Israel launches the heaviest air strikes on Beirut so far, with dozens reportedly killed across Lebanon over the past day.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2024/10/AFP__20241004__36J7683__v1__HighRes__LebanonIsraelPalestinianConflict-1728056244.jpg?resize=730%2C410&quality=80",
    "category": "World"
  },
  {
    "title": "Elon Musk to attend Donald Trump rally at site of July assassination attempt",
    "content": "Elon Musk is set to attend a rally in Texas on Saturday where former President Donald Trump is expected to speak...",
    "fullContent": "Elon Musk is set to attend a rally in Texas on Saturday where former President Donald Trump is expected to speak, according to a source familiar with the plans. The event will be held at the site of a July assassination attempt on Trump.",
    "image": "https://www.geo.tv/assets/uploads/updates/2024-10-04/567277_1938592_updates.jpg",
    "category": "World"
  },
  {
    "title": "US Capitol rioter who attacked police with fire extinguisher gets 5 years in prison",
    "content": "Iran's supreme leader has claimed its missile attack on Israel was fully legal and legitimate",
    "fullContent": "Iran's supreme leader has claimed its missile attack on Israel was fully legal and legitimate as he warned it will be done in the future again if it becomes necessary. In a rare speech, Ayatollah Ali Khamenei also described the event.",
    "image": "https://e3.365dm.com/24/10/2048x1152/skynews-iran-supreme-leader_6706227.jpg?20241004182307",
    "category": "World"
  },
  {
    "title": "At least 70 killed in gang massacre in Haiti",
    "content": "At least 70 people have been killed in a gang massacre in Haiti, the UN has said...",
    "fullContent": "At least 70 people have been killed in a gang massacre in Haiti, the UN has said. Armed gunmen belonging to the Gran Grif gang passed through the town of Pont-Sonde with automatic rifles, shooting at residents on Thursday, according to the United Nations Human Rights Office.",
    "image": "https://e3.365dm.com/24/10/2048x1152/skynews-haiti-gangs-crime_6706143.jpg?20241004164837",
    "category": "World"
  },
  {
    "title": "Yemen’s Houthi rebels release video claiming to have blown up British oil tanker in Red Sea",
    "content": "Houthi rebels have released a video claiming to show a British oil tanker being blown up...",
    "fullContent": "Houthi rebels have released a new video claiming to show a British oil tanker being blown up in the Red Sea. In the footage, what appears to be the Cordelia Moon erupts into a plume of smoke after being hit, causing severe damage. The group claims that eight ballistic missiles, a drone, and an unmanned surface boat were used in the attack. Sayyed Abdul-Malik al-Houthi, the leader of the Yemeni Ansar Allah movement, claims their operation targeted 188 boats. The crew has been confirmed as safe.",
    "image": "https://s.yimg.com/ny/api/res/1.2/C2nQ9DptTJpDgWrBnvC71Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE5MDA7aD0xMTg4O2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_258/d2f92f3c0155c8e17a7bdb5f4f45bac2",
    "category": "World"
  },
  {
    "title": "Tourist unknowingly films her final moments before falling to death in underpass",
    "content": "A tourist has died in Georgia after falling into an underpass while walking down a street...",
    "fullContent": "A tourist has died in Georgia after falling into an underpass while walking down a street. Russian woman Arina Glazunova was in Tbilisi, Georgia, with her friend on 27 September on a night out as they filmed themselves dancing and singing. The 24-year-old was unwittingly filming her final moments as she sang along to For The Last Time, a song by Russian boyband Hunger Boys, and the phone was passed back and forth between her and her friend.",
    "image": "https://images.ladbible.com/resize?type=webp&quality=70&width=3840&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/bltcd74acc1d0a99f3a/blt19a0cf327e212066/66fff5469cb981d6d58bd662/Woman-dies-falling-into-underpass.png",
    "category": "World"
  },
  {
    "title": "I never thought the Sony XM4 headphones would ever be this cheap – not even on Prime Day",
    "content": "I have to say, I'm pretty surprised to see the Sony WH-1000XM4 hit a new all-time low price of £180 at Amazon.",
    "fullContent": "I have to say, I'm pretty surprised to see the Sony WH-1000XM4 hit a new all-time low price of £180 at Amazon. If you are looking for wireless noise-cancelling over-ears but cannot afford the newer Sony WH-1000XM5 (currently £260 at Amazon), you would do well to snap up Sony's former flagships at this unprecedented price.",
    "image": "https://cdn.mos.cms.futurecdn.net/gFvUwYSRALkF6kpJewsEwS-1200-80.jpeg.webp",
    "category": "Technology"
  },
  {
    "title": "Apple Seeds Sixth Developer Betas of iOS 18.1 and iPadOS 18.1 With Apple Intelligence [Update: Public Beta Available]",
    "content": "The updates can be downloaded from the Settings app on a compatible device by going to General > Software Update. Note that Apple Intelligence features still an iPhone 15 Pro or iPhone 16 to run.",
    "fullContent": "The updates can be downloaded from the Settings app on a compatible device by going to General > Software Update. Note that Apple Intelligence features still require an iPhone 15 Pro or iPhone 16 to run. Apple Intelligence includes Writing Tools that are available wherever text can be selected and edited, and it can be used for spell checking, fixing grammar, rewriting with a new tone, and summarizing text.",
    "image": "https://images.macrumors.com/t/lgWq8_AejGHxBet9PyyojRnr1QI=/1600x0/article-new/2024/07/Apple-Intelligence-Feature-2.jpg",
    "category": "Technology"
  },
  {
    "title": "The best Apple deals in the Amazon Prime Day sale",
    "content": "Deal hunters assemble, the Amazon Prime Big Deals Day sale (aka its third Prime Day event of the year) has officially arrived",
    "fullContent": "Deal hunters assemble, the Amazon Prime Big Deals Day sale (aka its third Prime Day event of the year) has officially arrived. From now until midnight tomorrow (Wednesday 9 October), the online giant is discounting a roster of Apple products. This year’s autumn event is already shaping up to be the online giant’s best yet, making it the perfect time to shop the latest Apple products you’ve had your eye on. AirPods, iPhones, iPads, MacBooks, Apple Watches and AirTags have all plummeted in price.",
    "image": "https://images.macrumors.com/t/lgWq8_AejGHxBet9PyyojRnr1QI=/1600x0/article-new/2024/07/Apple-Intelligence-Feature-2.jpg",
    "category": "Technology"
  },
  {
    "title": "UK Covid spike – everything we know from tell-tale symptom to how to get test kit",
    "content": "A new and highly transmissible Covid variant is set to boost case numbers in the UK by Thursday, with experts urging Brits to get their autumn vaccines ahead of time.",
    "fullContent": "A new and highly transmissible Covid variant is set to boost case numbers in the UK by Thursday, with experts urging Brits to get their autumn vaccines ahead of time. The strain, named XEC, evolved from Omicron but is more transmissible than its predecessors - and is on its way to becoming the most dominant in the UK.",
    "image": "https://i2-prod.mirror.co.uk/incoming/article33842565.ece/ALTERNATES/s1200d/1_Woman-Takes-At-Home-COVID-Test.jpg",
    "category": "Health"
  },
  {
    "title": "People may be misdiagnosed with high blood pressure ‘due to arm position’",
    "content": "People may end up misdiagnosed with high blood pressure simply because their arm is in the wrong position when a reading is taken, researchers have warned.",
    "fullContent": "People may end up misdiagnosed with high blood pressure simply because their arm is in the wrong position when a reading is taken, researchers have warned. Experts found that some arm positions – such as resting the arm on the lap – can substantially overestimate blood pressure readings.",
    "image": "https://static.standard.co.uk/2024/10/07/16/07084602-4cb5e853-1bda-46ea-a641-b3846aaeaf07.jpg?crop=8:5,smart&quality=75&auto=webp&width=1000",
    "category": "Health"
  },
  {
    "title": "Scientists create surgical stitch to aid healing by electrical stimulation",
    "content": "The humble stitch plays a crucial role in surgery, holding a gash together while tissues repair.",
    "fullContent": "The humble stitch plays a crucial role in surgery, holding a gash together while tissues repair. Now scientists have created a type of suture they say can help speed up wound healing and reduce the risk of infection. Researchers in China have created a suture that when put under strain – as occurs during movement – electrically stimulates the wound.",
    "image": "https://i.guim.co.uk/img/media/42336fc1a766fe316358a7511fc3da622272f18a/0_0_4056_2434/master/4056.jpg?width=620&dpr=2&s=none",
    "category": "Health"
  }
]
